app/views/recommendations/_form.html.erb

    <%= f.label :type_id %>
    <%= f.collection_select :type_id, Type.all, :id, :name %>
---
SELECT "types".* FROM "types"