app/views/books/_form.html.erb

    <%= f.label :genre_id %>
    <%= f.collection_select :genre_id, Genre.all, :id, :name %>
---
SELECT "genres".* FROM "genres"