app/views/books/index.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = $1  [["user_id", 1]]
---
    <tbody>
      <% current_user.created_books.each do |book| %>