app/views/books/show.html.erb

        <tbody>
          <% @book.recommendations.each do |recommendation| %>
---
SELECT "recommendations".* FROM "recommendations" INNER JOIN "books_recommendations" ON "recommendations"."id" = "books_recommendations"."recommendation_id" WHERE "books_recommendations"."book_id" = $1  [["book_id", 4]]