app/controllers/books_controller.rb

  def create
    @book = current_user.books.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "author", "user_id", "created_at", "updated_at", "book_image", "genre_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "book"], ["author", "Jane Austen"], ["user_id", 1], ["created_at", 2016-08-10 12:26:56 UTC], ["updated_at", 2016-08-10 12:26:56 UTC], ["book_image", "PlanetEndor.jpg"], ["genre_id", 1]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "book_image" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["book_image", "PlanetEndor.jpg"], ["updated_at", 2016-08-10 08:49:05 UTC], ["id", 1]]

    def set_book
      @book = current_user.books.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]