app/controllers/comments_controller.rb

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 ORDER BY recommendations.created_at LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "This is an awesome book"], ["commentable_type", "Book"], ["commentable_id", 1], ["user_id", 1], ["created_at", 2016-08-08 11:08:28 UTC], ["updated_at", 2016-08-08 11:08:28 UTC]]
---
  def create
    recommendation = Recommendation.find_by(id: params[:id])
    comment = recommendation.comments.build(comment_params)
    comment.user = current_user

    if comment.save