app/controllers/comments_controller.rb

  def create
    book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]