app/controllers/comments_controller.rb

UPDATE "comments" SET "lft" = CASE WHEN "lft" BETWEEN 12 AND 12 THEN "lft" + 14 - 12 WHEN "lft" BETWEEN 13 AND 14 THEN "lft" + 12 - 13 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 12 AND 12 THEN "rgt" + 14 - 12 WHEN "rgt" BETWEEN 13 AND 14 THEN "rgt" + 12 - 13 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 7 THEN 6 ELSE "parent_id" END, updated_at = '2016-08-09 14:51:48.833240' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."commentable_id" = $1 AND "comments"."commentable_type" = $2 AND ("comments"."lft" BETWEEN 12 AND 14 OR "comments"."rgt" BETWEEN 12 AND 14) ORDER BY "comments"."lft")  [["commentable_id", 5], ["commentable_type", "Recommendation"]]
---
  def create
    commentable = commentable_type.constantize.find(commentable_id)
    @comment = Comment.build_from(commentable, current_user.id, body)

    respond_to do |format|
      if @comment.save