app/controllers/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)

    respond_to do |format|
      if @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Romance"], ["created_at", 2016-08-09 15:22:02 UTC], ["updated_at", 2016-08-09 15:22:02 UTC]]

    def set_genre
      @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]