app/controllers/recommendations_controller.rb

SELECT "recommendations".* FROM "recommendations" ORDER BY recommendations.created_at
---
  def index
    @recommendations = Recommendation.all

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 ORDER BY recommendations.created_at LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recommendation = Recommendation.find_by(id: params[:id])
    @new_comment = Comment.build_from(@recommendation, current_user.id, "")
    @current_book = Book.find_by_id(session[:current_book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def new
    @recommendation = Recommendation.new
    @current_book = Book.find_by_id(session[:current_book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "recommendations" ("name", "description", "created_at", "updated_at", "book_id", "type_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Wine"], ["description", "Good with anything"], ["created_at", 2016-08-08 16:29:31 UTC], ["updated_at", 2016-08-08 16:29:31 UTC], ["book_id", 1], ["type_id", 1], ["user_id", 1]]
---
  def create
    current_book = Book.find_by_id(session[:current_book_id])
    @recommendation = current_book.recommendations.new(recommendation_params)
    current_user.recommendations << @recommendation

DELETE FROM "recommendations" WHERE "recommendations"."id" = $1  [["id", 1]]
---
  def destroy
    @recommendation.destroy

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 ORDER BY recommendations.created_at LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def upvote
    @recommendation = Recommendation.find(params[:id])

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 ORDER BY recommendations.created_at LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def downvote
    @recommendation = Recommendation.find(params[:id])

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_recommendation
      @recommendation = Recommendation.find(params[:id])