app/controllers/statics_controller.rb

  def browse
    @books = Book.all
---
SELECT "books".* FROM "books"