app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "avatar_image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar_image", "PlanetEndor.jpg"], ["updated_at", 2016-08-07 16:13:47 UTC], ["id", 1]]